Repository: microsoft/WSL
Catalog: localization/strings/*/Resources.resw
Source language: en_us
Languages: cs_cz, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hu_hu, it_it, ja_jp, ko_kr, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ru_ru, sv_se, tr_tr, zh_cn, zh_tw

# Settings_OOBEVSCodeIntegration_VSCodeOpenProjectSample.Text
source: To open a project in VS Code from your WSL distribution, open the distributions command line and run 'code .' to open a project file. You can also access more VS Code Remote options through the command palette within VS Code itself. Hit SHIFT+CTRL+P on your keyboard to open the command palette and type Remote-WSL to see a list of the VS Code Remote options available, allowing you to reopen the folder in a remote session, specify which distribution you want to open, and more.
cs_cz: Chcete-li otevřít projekt v nástroji VS Code z distribuce WSL, otevřete příkazový řádek distribuce a spuštěním příkazu code . otevřete soubor projektu. K dalším možnostem VS Code Remote můžete přistupovat také prostřednictvím palety příkazů v samotném VS Code. Stisknutím SHIFT + CTRL + P na klávesnici otevřete paletu příkazů a zadáním Remote-WSL zobrazíte seznam dostupných možností VS Code Remote, které umožňují znovu otevřít složku ve vzdálené relaci, určit distribuci, kterou chcete otevřít, a mnohem více.
da_dk: Hvis du vil åbne et projekt i VS-kode fra WSL-distributionen, skal du åbne distributionens kommandolinje og køre 'code .' for at åbne en projektfil. Du kan også få adgang til flere Fjernindstillinger for VS-kode via kommandopaletten i selve VS-koden. Tryk på "SKIFT+CTRL+P" på tastaturet for at åbne kommandopaletten, og skriv "Remote-WSL" for at få vist en liste over tilgængelige Fjernindstillinger for VS-kode, så du kan åbne mappen igen i en fjernsession, angive, hvilken distribution du vil åbne og meget mere.
de_de: Um ein Projekt in VS Code von Ihrer WSL-Distribution aus zu öffnen, öffnen Sie die Befehlszeile der Distribution und führen Sie „code .“ aus, um eine Projektdatei zu öffnen. Sie können auch über die Befehlspalette in VS Code selbst auf weitere VS Code Remoteoptionen zugreifen. Drücken Sie „UMSCHALT+STRG+P“ auf Ihrer Tastatur, um die Befehlspalette zu öffnen, und geben Sie „Remote-WSL“ ein, um eine Liste der verfügbaren VS Code Remoteoptionen anzuzeigen, sodass Sie den Ordner in einer Remotesitzung erneut öffnen und angeben können, welche Distribution Sie öffnen möchten und mehr.
el_gr: Για να ανοίξετε ένα έργο στο VS Code από τη διανομή WSL σας, ανοίξτε τη γραμμή εντολών της διανομής και εκτελέστε το 'code .' για να ανοίξετε ένα αρχείο έργου. Μπορείτε επίσης να αποκτήσετε πρόσβαση σε περισσότερες επιλογές VS Code Remote μέσω της παλέτας εντολών μέσα στο ίδιο το VS Code. Πατήστε "SHIFT+CTRL+P" στο πληκτρολόγιό σας για να ανοίξετε την παλέτας εντολών και πληκτρολογήστε 'Remote-WSL' για να δείτε μια λίστα με τις διαθέσιμες επιλογές του VS Code Remote, επιτρέποντάς σας να ανοίξετε ξανά τον φάκελο σε μια απομακρυσμένη συνεδρία, να καθορίσετε ποια διανομή θέλετε να ανοίξετε και πολλά άλλα.
es_es: Para abrir un proyecto en VS Code desde su distribución WSL, abra la línea de comando de la distribución y ejecute 'code .' para abrir un archivo de proyecto. También puedes acceder a más opciones remotas de VS Code mediante la paleta de comandos dentro de VS Code. Presiona "MAYÚS+CTRL+P" en el teclado para abrir la paleta de comandos y escribe "Remote-WSL" para ver una lista de las opciones remotas de VS Code disponibles, lo que te permite volver a abrir la carpeta en una sesión remota, especificar qué distribución deseas abrir y mucho más.
fi_fi: Jos haluat avata projektin VS Codessa WSL-jakelusta, avaa jakelun komentorivi ja avaa projektitiedosto suorittamalla koodi . Voit käyttää myös muita VS Code Remote -asetuksia VS Coden komentovalikoiman kautta. Avaa komentovalikoima painamalla näppäinyhdistelmää VAIHTO+CTRL+P ja kirjoita Remote-WSL, niin näet luettelon käytettävissä olevista VS Code Remote -asetuksista, joiden avulla voit avata kansion uudelleen etäistunnossa, määrittää avattavan jakelun ja paljon muuta.
fr_fr: Pour ouvrir un projet dans VS Code à partir de votre distribution WSL, ouvrez la ligne de commande de la distribution et exécutez « code . » pour ouvrir un fichier de projet. Vous pouvez également accéder à davantage d'options VS Code Remote via la palette de commandes dans VS Code lui-même. Appuyez sur « MAJ+CTRL+P » sur votre clavier pour ouvrir la palette de commandes et tapez « Remote-WSL » pour voir une liste des options VS Code Remote disponibles, vous permettant de rouvrir le dossier dans une session à distance, de spécifier la distribution que vous souhaitez ouvrir, et plus encore.
hu_hu: Ha a WSL-disztribúcióból szeretne megnyitni egy projektet a VS Code-ban, nyissa meg a terjesztési parancssort, és futtassa a 'code .' parancsot egy projektfájl megnyitásához. A VS Code-ban található parancskatalógusban további VS Code Remote beállításokat is elérhet. A „SHIFT+CTRL+P” billentyűkombinációval nyissa meg a parancspalettát, és írja be a "Remote-WSL" parancsot a rendelkezésre álló VS Code Remote-beállítások listájának megtekintéséhez, lehetővé téve a mappa újbóli megnyitását egy távoli munkamenetben, adja meg a megnyitni kívánt disztribúciót és egyebeket.
it_it: Per aprire un progetto in VS Code dalla distribuzione WSL, apri la riga di comando della distribuzione ed esegui 'code .' per aprire un file di progetto. Puoi anche accedere a più opzioni remote di VS Code tramite il riquadro comandi all'interno di VS Code. Premi "MAIUSC+CTRL+P" sulla tastiera per aprire il riquadro comandi e digita 'Remote-WSL' per visualizzare un elenco delle opzioni remote di VS Code disponibili; ciò consente di riaprire la cartella in una sessione remota, specificare la distribuzione da aprire e altro ancora.
ja_jp: WSL ディストリビューションから VS Code でプロジェクトを開くには、ディストリビューションのコマンド ラインを開き、'code .' を実行してプロジェクト ファイルを開きます。 VS Code 自体のコマンド パレットから、より多くの VS Code リモート オプションにアクセスすることもできます。キーボードで “SHIFT + Ctrl + P” キーを押してコマンド パレットを開き、‘Remote-WSL’ と入力すると、使用可能な VS Code リモート オプションの一覧が表示されます。これにより、リモート セッションでフォルダーを再度開いたり、開くディストリビューションを指定したりできます。
ko_kr: WSL 배포에서 VS Code 프로젝트를 열려면 배포의 명령줄을 열고 'code .'를 실행하여 프로젝트 파일을 엽니다. VS Code 자체 내의 명령 팔레트를 통해 더 많은 VS Code 원격 옵션에 액세스할 수도 있습니다. 키보드에서 "SHIFT+CTRL+P"를 눌러 명령 팔레트를 열고 'Remote-WSL'을 입력하여 사용 가능한 VS Code 원격 옵션 목록을 확인하여 원격 세션에서 폴더를 다시 열고, 열려는 배포를 지정하는 등의 작업을 수행할 수 있습니다.
nb_no: For å åpne et prosjekt i VS Code WSL-distribusjonen, åpner du distribusjonens kommandolinje og kjører code . for å åpne en prosjektfil. Du kan også åpne flere eksterne alternativer for VS Code gjennom kommandopaletten i selve VS Code. Trykk på Skift+Ctrl+P på tastaturet for å åpne kommandopaletten, og skriv inn «Remote-WSL» for å se en liste over de eksterne alternativene for VS Code, slik at du kan åpne mappen på nytt i en ekstern økt, angi hvilken distribusjon du vil åpne, og mer.
nl_nl: Om een project te openen in VS Code vanuit uw WSL-distributie, opent u de opdrachtregel van de distributie en voert u 'code .' uit om een projectbestand te openen. U hebt ook toegang tot meer externe VS Code-opties via het opdrachtpalet in VS Code zelf. Druk op SHIFT+CTRL+P op het toetsenbord om het opdrachtpalet te openen en typ 'Remote-WSL' om een lijst met beschikbare externe VS Code-opties weer te geven (bijvoorbeeld de map opnieuw openen in een externe sessie, opgeven welke distributie u wilt openen en meer).
pl_pl: Aby otworzyć projekt w programie VS Code z poziomu dystrybucji podsystemu WSL, otwórz wiersz polecenia dystrybucji i uruchom polecenie „code .”, aby otworzyć plik projektu. Możesz również uzyskać dostęp do większej liczby opcji zdalnych programu VS Code za pomocą palety poleceń w samym programie VS Code. Naciśnij kombinację klawiszy „SHIFT+CTRL+P” na klawiaturze, aby otworzyć paletę poleceń, i wpisz „Remote-WSL” w celu wyświetlenia dostępnych opcji zdalnych programu VS Code, umożliwiając ponowne otwarcie folderu w sesji zdalnej, określenie dystrybucji, którą chcesz otworzyć i nie tylko.
pt_br: Para abrir um projeto no VS Code a partir da sua distribuição WSL, abra a linha de comando da distribuição e execute 'code .' para abrir um arquivo de projeto. Você também pode acessar mais opções do VS Code Remote através da paleta de comandos dentro do próprio VS Code. Pressione "SHIFT+CTRL+P" no teclado para abrir a paleta de comandos e digite 'Remote-WSL' para ver uma lista das opções do VS Code Remote disponíveis, permitindo reabrir a pasta em uma sessão remota, especificar qual distribuição você deseja abrir e mais.
pt_pt: Para abrir um projeto no VS Code a partir da sua distribuição do WSL, abra a linha de comandos da distribuição e execute 'code .' para abrir um ficheiro de projeto. Também pode aceder a mais Opções remotas do VS Code através da paleta de comandos no próprio VS Code. Faça “SHIFT+CTRL+P” no teclado para abrir a paleta de comandos e escreva “Remote-WSL” para ver uma lista das Opções remotas do VS Code disponíveis, permitindo-lhe reabrir a pasta numa sessão remota, especificar que distribuição pretende abrir e muito mais.
ru_ru: Чтобы открыть проект в VS Code из дистрибутива WSL, откройте командную строку дистрибутива и запустите команду "code .", чтобы открыть файл проекта. Существуют и другие варианты удаленного доступа к VS Code, находящиеся в палитре команд в самом VS Code. Нажмите клавиши "SHIFT+CTRL+P" на клавиатуре, чтобы открыть палитру команд, и введите "Remote-WSL" для просмотра списка доступных вариантов удаленной работы с VS Code. Этот интерфейс позволяет повторно открыть папку в удаленном сеансе, указать дистрибутив, который нужно открыть, и многое другое.
sv_se: Öppna ett projekt i VS Code från WSL-distributionen genom att öppna distributionens kommandorad och köra kod. För att öppna en projektfil. Du kan också komma åt fler VS Code-fjärralternativ via kommandopaletten inom själva VS Code. Tryck på SKIFT+CTRL+P på tangentbordet för att öppna kommandopaletten och skriv Remote-WSL om du vill se en lista över tillgängliga VS Code-fjärralternativ så att du kan öppna mappen igen i en fjärrsession, ange vilken distribution du vill öppna med mera.
tr_tr: WSL dağıtımınızdan VS Code'da bir proje açmak için dağıtımın komut satırını açın ve bir proje dosyası açmak için 'code .' komutunu çalıştırın. Ayrıca VS Code'un içindeki komut paleti aracılığıyla daha fazla VS Code Remote seçeneğine de erişebilirsiniz. Komut paletini açmak için klavyenizdeki “SHIFT+CTRL+P” tuşlarına basın ve kullanılabilir VS Code Remote seçeneklerinin listesini görmek için ‘Remote-WSL’ yazın. Bu işlem, uzak bir oturumda klasörü yeniden açmanıza, hangi dağıtımı açmak istediğinizi belirtmenize ve daha fazlasına olanak sağlar.
zh_cn: 若要在 WSL 发行版中使用 VS Code 打开项目，请打开该发行版的命令行并运行 'code .' 以打开项目文件。 还可以通过 VS Code 自身的命令面板访问更多 VS Code 远程选项。在键盘上点击 "Shift+Ctrl+P" 打开命令面板并键入 "Remote-WSL" 以查看可用的 VS Code 远程选项列表，以便可以重新打开远程会话中的文件夹、指定要打开的发行版，等等。
zh_tw: 如要透過 WSL 發行版本使用 VS Code 開啟專案，請開啟該發行版本的命令列，然後執行 'code .' 來開啟專案檔案。 您也可以透過 VS Code 本身的命令選擇區，使用更多 VS Code 遠端選項。在鍵盤上按 “SHIFT+CTRL+P” 開啟命令選擇區，然後鍵入 ‘Remote-WSL’ 來查看可用的 VS Code 遠端選項清單。這樣做可讓您在遠端工作階段中重新開啟資料夾，並指定要開啟的發行版本等。

# Settings_OOBE_HowToUse.Text
source: How to use
cs_cz: Jak používat
da_dk: Sådan bruges det
de_de: Anleitung
el_gr: Πώς να το χρησιμοποιήσετε
es_es: Cómo usarla
fi_fi: Toimintaohjeet
fr_fr: Procédure d’utilisation
hu_hu: Használati útmutató
it_it: Modalità di utilizzo
ja_jp: 使用方法
ko_kr: 사용 방법
nb_no: Brukerveiledning
nl_nl: Informatie over het gebruik
pl_pl: Jak używać
pt_br: Como usar
pt_pt: Como utilizar
ru_ru: Инструкции
sv_se: Så här använder du
tr_tr: Kullanma
zh_cn: 使用方法
zh_tw: 如何使用

# Settings_OptionalFeaturesPageTitle.Text
source: Optional Features
cs_cz: Volitelné funkce
da_dk: Valgfrie funktioner
de_de: Optionale Features
el_gr: Προαιρετικά χαρακτηριστικά
es_es: Funciones opcionales
fi_fi: Valinnaiset ominaisuudet
fr_fr: Fonctionnalités facultatives
hu_hu: Választható funkciók
it_it: Funzionalità facoltative
ja_jp: オプション機能
ko_kr: 선택적 기능
nb_no: Valgfrie funksjoner
nl_nl: Optionele onderdelen
pl_pl: Funkcje opcjonalne
pt_br: Recursos Opcionais
pt_pt: Funcionalidades Opcionais
ru_ru: Дополнительные функции
sv_se: Valfria funktioner
tr_tr: İsteğe Bağlı Özellikler
zh_cn: 可选功能
zh_tw: 選用功能

# Settings_PrivacyPolicyLink.Content
source: Privacy Statement
cs_cz: Prohlášení o zásadách ochrany osobních údajů
da_dk: Erklæring om beskyttelse af oplys.
de_de: Datenschutzbestimmung
el_gr: Δήλωση Απορρήτου
es_es: Declaración privacidad
fi_fi: Tietosuojatiedot
fr_fr: Déclaration
hu_hu: Adatvédelmi nyilatkozat
it_it: Informativa sulla privacy
ja_jp: プライバシーに関する声明
ko_kr: 개인 정보 취급 방침
nb_no: Personvernerklæring
nl_nl: Privacyverklaring
pl_pl: Oświadczenie o ochronie prywatności
pt_br: Política de Privacidade
pt_pt: Declaração de Privacidade
ru_ru: Заявление о конфиденциальности
sv_se: Sekretesspolicy
tr_tr: Gizlilik Bildirimi
zh_cn: 隐私声明
zh_tw: 隱私權聲明

# Settings_ProcCount.Header
source: Processor Count
cs_cz: Počet procesorů
da_dk: Processorantal
de_de: Prozessoranzahl
el_gr: Αριθμός Επεξεργαστών
es_es: Recuento del procesador
fi_fi: Suorittimen määrä
fr_fr: Nombre de processeurs
hu_hu: Processzorok száma
it_it: Conteggio processori
ja_jp: プロセッサ数
ko_kr: 프로세서 수
nb_no: Prosessorantall
nl_nl: Aantal processors
pl_pl: Liczba procesorów
pt_br: Contagem do Processador
pt_pt: Contagem de Processadores
ru_ru: Число процессоров
sv_se: Antal processorer
tr_tr: İşlemci Sayısı
zh_cn: 处理器计数
zh_tw: 處理器計數

# Settings_ProcCount.Description
source: How many logical processors to assign to the WSL 2 VM.
cs_cz: Kolik logických procesorů se má přiřadit virtuálnímu počítači WSL 2.
da_dk: Hvor mange logiske processorer der skal tildeles til WSL 2 VM.
de_de: Gibt an, wie viele logische Prozessoren der WSL 2-VM zugewiesen werden sollen.
el_gr: Πόσοι λογικοί επεξεργαστές θα εκχωρηθούν στην Εικονική Μηχανή WSL 2.
es_es: Número de procesadores lógicos que se asignarán a la VM WSL 2.
fi_fi: WSL 2 VM:lle määritettävät loogiset suorittimet.
fr_fr: Nombre de processeurs logiques à affecter à la machine virtuelle WSL 2.
hu_hu: A WSL 2 virtuális géphez hozzárendelni kívánt logikai processzorok száma.
it_it: Numero di processori logici da assegnare alla macchina virtuale WSL 2.
ja_jp: WSL 2 VM に割り当てる論理プロセッサの数。
ko_kr: WSL 2 VM에 할당할 논리 프로세서 수입니다.
nb_no: Hvor mange logiske prosessorer som skal tilordnes WSL 2 VM.
nl_nl: Hoeveel logische processors moeten worden toegewezen aan de VM van WSL 2.
pl_pl: Liczba procesorów logicznych do przypisania do maszyny wirtualnej WSL 2.
pt_br: Quantos processadores lógicos atribuir à VM do WSL 2.
pt_pt: Quantos processadores lógicos atribuir à VM WSL 2.
ru_ru: Число логических процессоров, назначаемое виртуальной машине WSL 2.
sv_se: Hur många logiska processorer som ska tilldelas den virtuella WSL 2-datorn.
tr_tr: WSL 2 VM'ye atanacak mantıksal işlemci sayısı.
zh_cn: 要分配给 WSL 2 VM 的逻辑处理器数量。
zh_tw: 要指派給WSL 2 VM 的邏輯處理器數目。

# Settings_ProcCountResetButton.Content
source: Reset count
cs_cz: Resetovat počet
da_dk: Nulstil antal
de_de: Anzahl zurücksetzen
el_gr: Επαναφορά αριθμού
es_es: Restablecer cuenta
fi_fi: Palauta määrä
fr_fr: Nombre de réinitialisations
hu_hu: Szám alaphelyzetbe állítása
it_it: Numero di reimpostazioni
ja_jp: カウントのリセット
ko_kr: 초기화 횟수
nb_no: Tilbakestill antall
nl_nl: Aantal opnieuw instellen
pl_pl: Resetuj liczbę
pt_br: Redefinir contagem
pt_pt: Repor a contagem
ru_ru: Сбросить счетчик
sv_se: Återställ antal
tr_tr: Sayımı sıfırla
zh_cn: 重置计数
zh_tw: 重設計數

# Settings_ProcCountTextBox.AutomationProperties.Name
source: Processor Count
cs_cz: Počet procesorů
da_dk: Processorantal
de_de: Prozessoranzahl
el_gr: Αριθμός Επεξεργαστών
es_es: Recuento del procesador
fi_fi: Suorittimen määrä
fr_fr: Nombre de processeurs
hu_hu: Processzorok száma
it_it: Conteggio processori
ja_jp: プロセッサ数
ko_kr: 프로세서 수
nb_no: Prosessorantall
nl_nl: Aantal processors
pl_pl: Liczba procesorów
pt_br: Contagem do Processador
pt_pt: Contagem de Processadores
ru_ru: Число процессоров
sv_se: Antal processorer
tr_tr: İşlemci Sayısı
zh_cn: 处理器计数
zh_tw: 處理器計數

# Settings_ProcCountTextBox.AutomationProperties.HelpText
source: How many logical processors to assign to the WSL 2 VM.
cs_cz: Kolik logických procesorů se má přiřadit virtuálnímu počítači WSL 2.
da_dk: Hvor mange logiske processorer der skal tildeles til WSL 2 VM.
de_de: Gibt an, wie viele logische Prozessoren der WSL 2-VM zugewiesen werden sollen.
el_gr: Πόσοι λογικοί επεξεργαστές θα εκχωρηθούν στην Εικονική Μηχανή WSL 2.
es_es: Número de procesadores lógicos que se asignarán a la VM WSL 2.
fi_fi: WSL 2 VM:lle määritettävät loogiset suorittimet.
fr_fr: Nombre de processeurs logiques à affecter à la machine virtuelle WSL 2.
hu_hu: A WSL 2 virtuális géphez hozzárendelni kívánt logikai processzorok száma.
it_it: Numero di processori logici da assegnare alla macchina virtuale WSL 2.
ja_jp: WSL 2 VM に割り当てる論理プロセッサの数。
ko_kr: WSL 2 VM에 할당할 논리 프로세서 수입니다.
nb_no: Hvor mange logiske prosessorer som skal tilordnes WSL 2 VM.
nl_nl: Hoeveel logische processors moeten worden toegewezen aan de VM van WSL 2.
pl_pl: Liczba procesorów logicznych do przypisania do maszyny wirtualnej WSL 2.
pt_br: Quantos processadores lógicos atribuir à VM do WSL 2.
pt_pt: Quantos processadores lógicos atribuir à VM WSL 2.
ru_ru: Число логических процессоров, назначаемое виртуальной машине WSL 2.
sv_se: Hur många logiska processorer som ska tilldelas den virtuella WSL 2-datorn.
tr_tr: WSL 2 VM'ye atanacak mantıksal işlemci sayısı.
zh_cn: 要分配给 WSL 2 VM 的逻辑处理器数量。
zh_tw: 要指派給WSL 2 VM 的邏輯處理器數目。

# Settings_RelatedLinks.Text
source: Related links
cs_cz: Související propojení
da_dk: Relaterede links
de_de: Verwandte Links
el_gr: Σχετικοί σύνδεσμοι
es_es: Vínculos relacionados
fi_fi: Aiheeseen liittyviä linkkejä
fr_fr: Liens connexes
hu_hu: Kapcsolódó hivatkozások
it_it: Collegamenti correlati
ja_jp: 関連するリンク
ko_kr: 관련 링크
nb_no: Beslektede koblinger
nl_nl: Verwante koppelingen
pl_pl: Pokrewne łącza:
pt_br: Links relacionados
pt_pt: Ligações relacionadas
ru_ru: Ссылки по теме
sv_se: Relaterade länkar
tr_tr: İlgili bağlantılar
zh_cn: 相关链接
zh_tw: 相關連結

# Settings_ReleaseNotesLink.Content
source: Release notes
cs_cz: Poznámky k verzi
da_dk: Produktbemærkninger
de_de: Versionshinweise
el_gr: Σημειώσεις έκδοσης
es_es: Notas de la versión
fi_fi: Julkaisutiedot
fr_fr: Notes de publication
hu_hu: Kibocsátási megjegyzések
it_it: Note sulla versione
ja_jp: リリース ノート
ko_kr: 릴리스 정보
nb_no: Produktmerknader
nl_nl: Opmerkingen bij de release
pl_pl: Informacje o wersji
pt_br: Notas de versão
pt_pt: Notas de versão
ru_ru: Заметки о выпуске
sv_se: Viktig information
tr_tr: Sürüm notları
zh_cn: 发行说明
zh_tw: 版本資訊

# Settings_SafeMode.Header
source: Enable safe mode
cs_cz: Povolit nouzový režim
da_dk: Aktivér fejlsikret tilstand
de_de: Aktivieren des abgesicherten Modus
el_gr: Ενεργοποίηση ασφαλούς λειτουργίας
es_es: Habilitar el modo seguro
fi_fi: Ota käyttöön vikasietotila
fr_fr: Activer le mode sécurisé
hu_hu: Csökkentett mód engedélyezése
it_it: Abilita modalità provvisoria
ja_jp: セーフ モードを有効にする
ko_kr: 안전 모드 사용
nb_no: Aktiver Sikker modus
nl_nl: Veilige modus inschakelen
pl_pl: Włącz tryb awaryjny
pt_br: Habilitar modo seguro
pt_pt: Ativar modo de segurança
ru_ru: Включить безопасный режим
sv_se: Aktivera felsäkert läge
tr_tr: Güvenli modu etkinleştir
zh_cn: 启用安全模式
zh_tw: 啟用安全模式

# Settings_SafeMode.Description
source: Run WSL in "Safe Mode" which disables many features and is intended to be used to recover distributions that are in bad states.
cs_cz: Spusťte WSL v nouzovém režimu, který zakáže mnoho funkcí a je určen k obnovení distribucí, které jsou ve špatném stavu.
da_dk: Kør WSL i "Fejlsikret tilstand", som deaktiverer mange funktioner og er beregnet til at blive brugt til at genoprette distributioner, der er i beskadigede tilstande.
de_de: Führen Sie die WSL im „abgesicherten Modus“ aus, in dem viele Features deaktiviert sind. Dieser Modus ist für die Wiederherstellung von fehlerhaften Distributionen gedacht.
el_gr: Εκτελεί το WSL σε "Ασφαλή λειτουργία", η οποία απενεργοποιεί πολλές δυνατότητες και προορίζεται για χρήση με σκοπό την ανάκτηση διανομών που βρίσκονται σε κακή κατάσταση.
es_es: Ejecute WSL en "Modo seguro" que deshabilite muchas características y que esté pensado para su uso para recuperar distribuciones en mal estado.
fi_fi: Suorita WSL vikasietotilassa, joka poistaa käytöstä monia ominaisuuksia ja jota on tarkoitus käyttää palauttamaan jakaumia, jotka ovat virheellisessä tilassa.
fr_fr: Exécutez WSL en mode sans échec, ce qui désactive de nombreuses fonctionnalités et est destiné à être utilisé pour récupérer les distributions dont l’état est incorrect.
hu_hu: Futtatja a WSL-t csökkentett módban, amely számos funkciót letilt, és a rossz állapotú disztribúciók helyreállítására szolgál.
it_it: Eseguire WSL in "Modalità provvisoria" che disabilita molte funzionalità e deve essere utilizzato per ripristinare distribuzioni in stato non valido.
ja_jp: WSL を "セーフ モード" で実行すると、多くの機能が無効になり、無効な状態のディストリビューションの回復に使用されます。
ko_kr: 많은 기능을 사용하지 않도록 설정하고 잘못된 상태의 배포를 복구하는 데 사용되는 "안전 모드"에서 WSL을 실행합니다.
nb_no: Kjør WSL i Sikkermodus som deaktiverer mange funksjoner og er ment å brukes til å gjenopprette distribusjoner som er i ugyldige tilstander.
nl_nl: Voer WSL uit in de veilige modus. Hierdoor worden veel functies uitgeschakeld en kunnen distributies met een slechte status worden hersteld.
pl_pl: Uruchom podsystem WSL w „trybie awaryjnym”, który wyłącza wiele funkcji i jest przeznaczony do odzyskiwania dystrybucji, które są w złych stanach.
pt_br: Execute o WSL em "Modo de Segurança", que desabilita muitos recursos e destina-se a ser usado para recuperar distribuições que estão em estados inválidos.
pt_pt: Execute o WSL no "Modo de Segurança", o que desativa muitas funcionalidades e se destina a ser utilizado para recuperar distribuições que estejam em estados incorretos.
ru_ru: Запускайте WSL в "безопасном режиме", который отключает многие функции и предназначен для восстановления дистрибутивов, находящихся в плохом состоянии.
sv_se: Kör WSL i felsäkert läge, vilket inaktiverar många funktioner och är avsett att användas för att återställa distributioner i felaktiga tillstånd.
tr_tr: WSL'yi birçok özelliği devre dışı bırakan ve kötü durumdaki dağıtımları kurtarmak için kullanılması amaçlanan "Güvenli Mod "da çalıştırın.
zh_cn: 在“安全模式”下运行 WSL，这将禁用许多功能，并用于恢复处于错误状态的分发。
zh_tw: 以「安全模式」執行 WSL，此模式會停用許多功能，並用於復原處於錯誤狀態的發佈。

# Settings_SafeModeToggleSwitch.AutomationProperties.Name
source: Enable safe mode.
cs_cz: Povolte nouzový režim.
da_dk: Aktivér fejlsikret tilstand.
de_de: Aktivieren des abgesicherten Modus.
el_gr: Ενεργοποίηση ασφαλούς λειτουργίας.
es_es: Habilitar el modo seguro.
fi_fi: Ota käyttöön vikasietotila.
fr_fr: Activez le mode sans échec.
hu_hu: Csökkentett mód engedélyezése.
it_it: Abilita modalità provvisoria.
ja_jp: セーフ モードを有効にします。
ko_kr: 안전 모드를 사용하도록 설정합니다.
nb_no: Aktiver sikkermodus.
nl_nl: Veilige modus inschakelen.
pl_pl: Włącz tryb awaryjny.
pt_br: Habilitar modo seguro.
pt_pt: Ativar modo de segurança.
ru_ru: Включить безопасный режим.
sv_se: Aktivera felsäkert läge.
tr_tr: Güvenli modu etkinleştirin.
zh_cn: 启用安全模式。
zh_tw: 啟用安全模式。
